
###################################################################
########################### Variables #############################
###################################################################
#set SSLIB "/home/IC/System/UART_TX/std_cells/scmetro_tsmc_cl013g_rvt_ss_1p08v_125c.db"
#set TTLIB "/home/IC/System/UART_TX/std_cells/scmetro_tsmc_cl013g_rvt_tt_1p2v_25c.db"
#set FFLIB "/home/IC/System/UART_TX/std_cells/scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c.db"



set SSLIB "/home/IC/Labs/SYSTEM/std_cells/scmetro_tsmc_cl013g_rvt_ss_1p08v_125c.db"
set TTLIB "/home/IC/Labs/SYSTEM/std_cells/scmetro_tsmc_cl013g_rvt_tt_1p2v_25c.db"
set FFLIB "/home/IC/Labs/SYSTEM/std_cells/scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c.db"


###################################################################
############################ Guidance #############################
###################################################################

# Synopsys setup variable
set synopsys_auto_setup true

# Formality Setup File
set_svf "/home/IC/Labs/SYSTEM/syn/system.svf"

###################################################################
###################### Reference Container ########################
###################################################################

# Read Reference Design Verilog Files
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/ALU.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/Async_fifo.v" 
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/ClkDiv.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/CLKDIV_MUX.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/CLK_GATE.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/data_sampling_rx.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/BIT_SYNC_solution.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/deserializer_rx.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/DF_Sync.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/edge_bit_counter.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/fifo_mem.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/fifo_rd.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/fifo_wr.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/uart_fsm.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/uart_rx_fsm.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/uart_mux.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/parity_calc.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/parity_check_rx.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/PULSE_GEN.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/RegFile.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/RST_SYNC.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/serializer.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/stop_check_rx.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/strt_check_rx.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/sys_ctrl.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/SYS_TOP.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/uart_rx_top.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/uart_top.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/UART.v"
read_verilog -container Ref "/home/IC/Labs/SYSTEM/rtl/DATA_SYNC.v"






# Read Reference technology libraries
read_db -container Ref [list $SSLIB $TTLIB $FFLIB]

# set the top Reference Design 
set_reference_design SYS_TOP
set_top SYS_TOP


###################################################################
#################### Implementation Container #####################
###################################################################

# Read Implementation Design Files
# read_verilog -container Imp -netlist "/home/IC/Labs/SYSTEM/syn/System_Top.v"

read_verilog -netlist -container Imp "/home/IC/Labs/SYSTEM/syn/System_Top.v"

# Read Implementation technology libraries
read_db -container Imp [list $SSLIB $TTLIB $FFLIB]

# set the top Implementation Design
set_implementation_design SYS_TOP
set_top SYS_TOP

###################### Matching Compare points ####################

match

######################### Run Verification ########################

set successful [verify]
if {!$successful} {
diagnose
analyze_points -failing
}

########################### Reporting ############################# 
report_passing_points > "passing_points.rpt"
report_failing_points > "failing_points.rpt"
report_aborted_points > "aborted_points.rpt"
report_unverified_points > "unverified_points.rpt"


start_gui

